export const renderGrid = (grid) => {
    const [
        a, b, c,
        d, e, f,
        g, h, i,
    ] = grid.map(cell => cell === null
        ? ' '
        : cell === 1
            ? 'X'
            : 'O',
    );

    return `\`\`\``
    + `    0   1   2\n`
    + `  ╔═══╦═══╦═══╗\n`
    + `A ║ ${a} ║ ${b} ║ ${c} ║ 0️⃣ 1️⃣ 2️⃣\n`
    + `  ╠═══╬═══╬═══╣\n`
    + `B ║ ${d} ║ ${e} ║ ${f} ║ 3️⃣ 4️⃣ 5️⃣\n`
    + `  ╠═══╬═══╬═══╣\n`
    + `C ║ ${g} ║ ${h} ║ ${i} ║ 6️⃣ 7️⃣ 8️⃣\n`
    + `  ╚═══╩═══╩═══╝\n`
    + `\`\`\``;
};